{
  "participants": [
    {
      "date_of_interview": "2025-03-09",
      "first_name": "Mattias",
      "birth_year": 1998,
      "gender": "Male",
      "occupation_profession": "Automation",
      "education": "Automation Engineer",
      "response": "He feels like cost is the primary obstacle to adoption. He believes the high price will significantly delay widespread implementation. Drawing parallels to industrial ABB robots with similar technology, he estimates it will take until 2045 (20 years from now), though he acknowledges the core technology might be developed earlier.",
      "years_prediction": 20
    },
    {
      "date_of_interview": "2025-03-09",
      "first_name": "Rasmus",
      "birth_year": 1996,
      "gender": "Male",
      "occupation_profession": "Software Engineering",
      "education": "Master's in Computer Science",
      "response": "He feels like the hardware is mostly available already, and the key ingredients for intelligence (transformer/GPT architecture) have been created. He believes it's simply about collecting or simulating more data. Regarding costs, he thinks these robots might be expensive but not as costly as today's industrial robots—perhaps two or three times the average salary. He also notes that societal incentives would be strong, especially given aging populations, which could accelerate adoption. He estimates it will take about 15 years from now to reach this point.",
      "years_prediction": 15
    },
    {
      "date_of_interview": "2025-03-09",
      "first_name": "Johnny",
      "birth_year": 1963,
      "gender": "Male",
      "occupation_profession": "B2B Sales, Industrial Worker",
      "education": "None",
      "response": "He feels like tuning the guitar would be the easiest task, while changing bedclothes would be more difficult (tucking in sheets, etc.). He thinks preparing salmon shouldn't be too hard (the robot could check defrosting times online, as the information is readily available). He notes that ChatGPT already understands everything he says today. Assuming global leaders don't disrupt progress, and development continues as it has been, he estimates it will take about 15 years. He also mentions concerns about human contact diminishing for a while.",
      "years_prediction": 15
    },
    {
      "date_of_interview": "2025-03-10",
      "first_name": "Alexander",
      "birth_year": 1996,
      "gender": "Male",
      "occupation_profession": "Software Engineer (in training)",
      "education": "Half way through 2-year Software Engineering program",
      "response": "He feels like we're not far from humanoid robots, referencing Boston Dynamics' robot dogs and humanoids, as well as robots with 'real' muscles. He believes connecting GPT to such a system is feasible but notes complications in making them do non-preprogrammed tasks. He predicts tech demos within five years, with first consumers getting this technology around 2035. He acknowledges first-generation products will be buggy and slower than humans, technically capable but with poor execution (like poorly chopped vegetables). He thinks tasks like wall plastering would be easier than bed-making, which requires more fine motor skills. By 2036, he believes seeing such robots would no longer be surprising. Cost remains a barrier both for innovation and consumer adoption, along with social acceptance.",
      "years_prediction": 11
    },
    {
      "date_of_interview": "2025-03-10",
      "first_name": "Emil",
      "birth_year": 1994,
      "gender": "Male",
      "occupation_profession": "Business and IT",
      "education": "Civilingenjör in Business and IT",
      "response": "He feels like Boston Dynamics' Atlas is already close to the required capability, but distinguishes between technical feasibility and consumer adoption. He identifies safety and legal aspects as the main barriers, similar to self-driving cars. He believes we might see these robots in public spaces around 2030, noting material costs (titanium and aluminum) as a challenge for consumer versions. He mentions that specialized AI robots for home use already exist but aren't general-purpose. He feels a growing techno-skepticism and suggests that after seeing such robots 2-3 times, they would no longer be surprising to him.",
      "years_prediction": 5
    },
    {
      "date_of_interview": "2025-03-12",
      "first_name": "Sophia",
      "birth_year": 1997,
      "gender": "Female",
      "occupation_profession": "Architecture",
      "education": "Arkitektutbildning",
      "response": "She feels it's very difficult to estimate a timeframe. She thinks wall plastering would be especially challenging for robots. Guitar tuning would also be difficult, though tuning should be easier. Dusting the piano should be relatively simple. She estimates it will take about 20 years. She reflects on how such technology might make people lazier, noting she's already experiencing this effect with ChatGPT. She mentions she would still prefer to do some tasks herself, like painting, but fears she might become too reliant on automation.",
      "years_prediction": 20
    },
    {
      "date_of_interview": "2025-05-20",
      "first_name": "Marcus",
      "birth_year": 1996,
      "gender": "Male",
      "occupation_profession": "Marketing/BI",
      "education": "Vocational university - Marketing/BI",
      "response": "He emphasizes that the most difficult thing for AI is understanding human practical judgment and common sense. He gives examples like 'How much should I salt?' when cooking, or how much water to give plants - tasks that seem simple but require intuitive understanding that humans develop through experience. He believes that while robots might be able to handle technical tasks like flipping salmon or other mechanical cooking processes, the nuanced decision-making involved in everyday tasks will be much harder to master. Based on these considerations about the complexity of human practical wisdom, he estimates it will take 35 years.",
      "years_prediction": 35
    }
  ]
} 